wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПравилаМаршрутизацииЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыСогласованияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейЗаявкиНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеДляСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходДСПлан</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыПоказателейЗаявкиНаРасходДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПоказателейЗаявкиНаРасходДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Статья</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидСравненияЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидСравненияЗначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервале</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяЛево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИнтервалеВключаяПраво</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ПравилаМаршрутизацииЗаявок/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидПоказателяВидОперации = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ВидОперации;
	ВидПоказателяСтатья 	 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Статья;
	ВидПоказателяАвтор 		 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Автор;
	ВидПоказателяСумма 		 = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.Сумма;
	ВидыОперацийПустаяСсылка = Перечисления.ВидыПоказателейЗаявкиНаРасходДС.ПустаяСсылка();
	ПользователиПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	СтатьяПустаяссылка 	 = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Параметры.Маршрут) Тогда
		Запись.Маршрут = Параметры.Маршрут;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ВидПоказателя) Тогда
		Запись.ВидПоказателя = Параметры.ВидПоказателя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДанныеЗаявки) Тогда
		ДанныеЗаявки = Параметры.ДанныеЗаявки;
		Запись.ВидПоказателя = ВидПоказателяАвтор;
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Автор;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидСравнения();
	
	Если Не ЗначениеЗаполнено(Запись.ЗначениеДляСравнения) Тогда
		УстановитьТипЗначенияДляСравнения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	
	УстановитьВидСравнения();
	УстановитьТипЗначенияДляСравнения();
	
	Если ЗначениеЗаполнено(ДанныеЗаявки) Тогда
		УстановитьЗначениеДляСравнения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидСравнения()
	
	Если Запись.ВидПоказателя <> ВидПоказателяСумма Тогда
	
		Элементы.ВидСравнения.КнопкаВыпадающегоСписка = Ложь;
		Элементы.ВидСравнения.ТолькоПросмотр = Истина;
		Запись.ВидСравнения = ПредопределенноеЗначение("Перечисление.ВидСравненияЗначений.Равно");
		
	Иначе
		
		Элементы.ВидСравнения.КнопкаВыпадающегоСписка = Истина;
		Элементы.ВидСравнения.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьТипЗначенияДляСравнения()
	
	Если Запись.ВидПоказателя = ВидПоказателяВидОперации Тогда
		
		Запись.ЗначениеДляСравнения = ВидыОперацийПустаяСсылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСтатья Тогда
		
		Запись.ЗначениеДляСравнения = СтатьяПустаяссылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяАвтор Тогда
		
		Запись.ЗначениеДляСравнения = ПользователиПустаяСсылка;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСумма Тогда
		
		Запись.ЗначениеДляСравнения = 0;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДляСравнения()
	
	Если Запись.ВидПоказателя = ВидПоказателяВидОперации Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.ВидОперации;
	
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСтатья Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Статья;
	
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяАвтор Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Автор;
		
	ИначеЕсли Запись.ВидПоказателя = ВидПоказателяСумма Тогда
		
		Запись.ЗначениеДляСравнения = ДанныеЗаявки.Сумма;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
